Revit 2027 API
BuiltInFailures.SlabShapeFailures.SlopedInnerEdge Property
 Inner loops of a footprint sketch may not have slope-defining lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SlopedInnerEdge { get; }
Public Shared ReadOnly Property SlopedInnerEdge As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SlopedInnerEdge {
	FailureDefinitionId^ get ();
}
static member SlopedInnerEdge : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SlabShapeFailures Class
Autodesk.Revit.DB Namespace